results/raw/interregion/flannel-interregion-apachebench_1M_200_stdout.log
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.10.0.2 (be patient)


Server Software:        nginx/1.18.0
Server Hostname:        10.10.0.2
Server Port:            30080

Document Path:          /
Document Length:        612 bytes

Concurrency Level:      200
Time taken for tests:   113.437 seconds
Complete requests:      1000000
Failed requests:        0
Total transferred:      854000000 bytes
HTML transferred:       612000000 bytes
Requests per second:    8815.48 [#/sec] (mean)
Time per request:       22.687 [ms] (mean)
Time per request:       0.113 [ms] (mean, across all concurrent requests)
Transfer rate:          7351.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        9   10  10.9     10    1046
Processing:     9   12   2.2     12      48
Waiting:        7   12   2.0     12      48
Total:         18   23  11.1     22    1062

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     23
  75%     24
  80%     24
  90%     25
  95%     27
  98%     29
  99%     31
 100%   1062 (longest request)